plugins/Signature_Wrapping/src/test/resources/signed_xspres_message.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--

    WS-Attacker - A Modular Web Services Penetration Testing Framework
    Copyright (C) 2011  Christian Mainka

    This program is free software; you can redistribute it and/or
    modify it under the terms of the GNU General Public License
    as published by the Free Software Foundation; either version 2
    of the License, or (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program; if not, write to the Free Software
    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:axis="http://axis2">
  <soapenv:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsu:Created>2011-11-28T22:58:56Z</wsu:Created>
        <wsu:Expires>2011-11-28T23:13:56Z</wsu:Expires>
      </wsu:Timestamp>
      <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
          <ds:Reference URI="">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2002/06/xmldsig-filter2">
                <XPath xmlns="http://www.w3.org/2002/06/xmldsig-filter2" Filter="intersect">/*[local-name()="Envelope" and namespace-uri()="http://schemas.xmlsoap.org/soap/envelope/"][1]/*[local-name()="Body" and namespace-uri()="http://schemas.xmlsoap.org/soap/envelope/"][1]</XPath>
                <XPath xmlns="http://www.w3.org/2002/06/xmldsig-filter2" Filter="union">/*[local-name()="Envelope" and namespace-uri()="http://schemas.xmlsoap.org/soap/envelope/"][1]/*[local-name()="Header" and namespace-uri()="http://schemas.xmlsoap.org/soap/envelope/"][1]/*[local-name()="Security" and namespace-uri()="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"][1]/*[local-name()="Timestamp" and namespace-uri()="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"][1]</XPath>
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <ds:DigestValue>GesnkyrHY2IGuOWIDdjSe9htdrs=</ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue>EnOUjZmi3HHPusxpZ8YVL8rgILLm9DuU7DJNHUpYxGf8nBalrnkyq+yFIpHD8X7swz+ehTBPF1TU
tgFeZeFBIsZ/PAA0lV3s/pKV8jkC8cpkOzoV6wYMWXKwmQGPnSGhI1dbJG6V8XhosiIol942+zdi
4INBDUTqb+V/4/l0NIU=</ds:SignatureValue>
        <ds:KeyInfo>
          <ds:X509Data>
            <ds:X509SubjectName>CN=Alice,OU=XSPRESS,O=RUB,ST=NRW,C=DE</ds:X509SubjectName>
            <ds:X509Certificate>MIICuDCCAiGgAwIBAgIBATANBgkqhkiG9w0BAQUFADB8MQswCQYDVQQGEwJERTEMMAoGA1UECAwD
TlJXMQ8wDQYDVQQHDAZCb2NodW0xDDAKBgNVBAoMA1JVQjEQMA4GA1UECwwHWFNQUkVTUzEPMA0G
A1UEAwwGVGVzdENBMR0wGwYJKoZIhvcNAQkBFg5UZXN0Q0FAeHNwcmVzczAeFw0xMTA4MDcxMjEy
NDFaFw0xMjA4MDYxMjEyNDFaMEsxCzAJBgNVBAYTAkRFMQwwCgYDVQQIEwNOUlcxDDAKBgNVBAoT
A1JVQjEQMA4GA1UECxMHWFNQUkVTUzEOMAwGA1UEAxMFQWxpY2UwgZ8wDQYJKoZIhvcNAQEBBQAD
gY0AMIGJAoGBANbijRO99DtXzOvjdp4jnXyErO9kdVehGpEOpEWqOFILPD18GcEJzJTKW4cVtBYs
mp7QqTVWrFi47dJJPz2fwoB9WGpBbm4ufLAUA4rqNx+pLlmF9Hfk8Is1fdbP0xZQXg5nbrb1ZSfc
AxqmtbsGBdV9WKvHjomBHcqMrDMnrc33AgMBAAGjezB5MAkGA1UdEwQCMAAwLAYJYIZIAYb4QgEN
BB8WHU9wZW5TU0wgR2VuZXJhdGVkIENlcnRpZmljYXRlMB0GA1UdDgQWBBRrbsxJOAq7vP95fcrG
2XsydeWp7zAfBgNVHSMEGDAWgBS9VS/73EZbsbTvp/6JnrV6scVelzANBgkqhkiG9w0BAQUFAAOB
gQBh5nYPzkfCnt44FpR3GpxQtrROfqKIef04hfudeyNboLiH2dG/Bb8DDygl1iOZKQ5CPx5mpsKO
IzGzraWrhhWZ+taAFqGnfjrTcDqL1LSsKEKkFSIJbR6GIIluZOCRs0OUYxsn5lSNubPJsUxiiW2Y
DMZlbKZX7a6siyPY+pUFjQ==</ds:X509Certificate>
          </ds:X509Data>
        </ds:KeyInfo>
      </ds:Signature>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <axis:helloName>
      <axis:name>John</axis:name>
    </axis:helloName>
  </soapenv:Body>
</soapenv:Envelope>
